kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
  // Fill MSP packet
  msp_out.type = MSP_PACKET_V1_CMD;
  msp_out.flags = MSP_VERSION | MSP_STARTFLAG;
  msp_out.function = MSP_VTX_SET_CONFIG;
  msp_out.payloadSize = sizeof(vtx_cmd);
  memcpy((void*)msp_out.payload, vtx_cmd, sizeof(vtx_cmd));
  // Send packet
  msp_handler.sendPacket(&msp_out, &my_ctrl_serial);
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;
  //Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);

  switch (type)
  {
  case WStype_DISCONNECTED:
    //Serial.printf("[%u] Disconnected!\r\n", num);
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
    socketNumber = num;

    webSocket.sendTXT(num, my_ipaddress_info_str);
    webSocket.sendTXT(num, espnow_init_info);

    // Send settings
    SettingsGet();
  }
  break;
  case WStype_TEXT:
    //Serial.printf("[%u] get Text: %s\r\n", num, payload);
    // send data to all connected clients
    //webSocket.broadcastTXT(payload, length);

    temp = strstr((char*)payload, "stm32_cmd=");
    if (temp) {
      // Command STM32
      if (strstr((char*)&temp[10], "reset")) {
        // Reset STM32
        reset_stm32_to_app_mode();
      }
    } else {
      // ExLRS setting commands
      temp = strstr((char*)payload, "S_rate");
      if (temp) {
        handleSettingRate(&temp[6], num);
        break;
      }
      temp = strstr((char*)payload, "S_power");
      if (temp) {
        handleSettingPower(&temp[7], num);
        break;
      }
      temp = strstr((char*)payload, "S_telemetry");
      if (temp) {
        handleSettingTlm(&temp[11], num);
      }
    }
    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    //Serial.printf("Invalid WStype [%d]\r\n", type);
    //webSocket.broadcastTXT("Invalid WStype: " + type);
    break;
  }
}

void sendReturn()
{
  server.send_P(200, "text/html", GO_BACK);
}

void handleRoot()
{
  server.send_P(200, "text/html", INDEX_HTML);
}


bool flashR9M()
{
  webSocket.broadcastTXT("R9M Firmware Flash Requested!");
  stm32flasher_hardware_init();
  webSocket.broadcastTXT("Going to flash the following file: " + uploadedfilename);
  bool result = esp8266_spifs_write_file(uploadedfilename.c_str());
  if (result == 0)
    reset_stm32_to_app_mode(); // boot into app
  Serial.begin(460800);
  return result;
}

void handleFileUpload()
{ // upload a new file to the SPIFFS
  HTTPUpload &upload = server.upload();
  if (upload.status == UPLOAD_FILE_START)
  {

    if (SPIFFS.info(fs_info))
    {
      String output;
      output += "Filesystem: used: ";
      output += String(fs_info.usedBytes);
      output += " / free: ";
      output += String(fs_info.totalBytes);
      webSocket.broadcastTXT(output);
    }
    else
    {
      webSocket.broadcastTXT("SPIFFs Failed to init!");
      return;
    }
    uploadedfilename = upload.filename;

    webSocket.broadcastTXT("Uploading file: " + uploadedfilename);

    if (!uploadedfilename.startsWith("/"))
    {
      uploadedfilename = "/" + uploadedfilename;
    }
    fsUploadFile = SPIFFS.open(uploadedfilename, "w"); // Open the file for writing in SPIFFS (create if it doesn't exist)
  }
  else if (upload.status == UPLOAD_FILE_WRITE)
  {
    if (fsUploadFile)
    {
      fsUploadFile.write(upload.buf, upload.currentSize); // Write the received bytes to the file
      TotalUploadedBytes += int(upload.currentSize);
      String output = "";
      output += "Uploaded: ";
      output += String(TotalUploadedBytes);
      output += " bytes";
      webSocket.broadcastTXT(output);
    }
  }
  else if (upload.status == UPLOAD_FILE_END)
  {
    if (fsUploadFile)
    {                       // If the file was successfully created
      fsUploadFile.close(); // Close the file again
      String totsize = String(upload.totalSize);
      webSocket.broadcastTXT("Total uploaded size: " + totsize);
      TotalUploadedBytes = 0;
      server.send(100);
      if (flashR9M())
      {
        server.sendHeader("Location", "/return"); // Redirect the client to the success page
        server.send(303);
        webSocket.broadcastTXT("Update Sucess!!!");
      }
      else
      {
        server.sendHeader("Location", "/return"); // Redirect the client to the success page
        server.send(303);
        webSocket.broadcastTXT("Update Failed!!!");
      }
    }
    else
    {
      server.send(500, "text/plain", "500: couldn't create file");
      SPIFFS.format();
    }
  }
}

void handleNotFound()
{
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
}

void handleMacAddress()
{
  String message = "My MAC address: ";
  message += WiFi.macAddress();
  message += "\n";
  server.send(200, "text/plain", message);
}

/******************* ESP-NOW *********************/
#if ESP_NOW

#include <espnow.h>

void esp_now_recv_cb(uint8_t *mac_addr, uint8_t *data, uint8_t data_len)
{
  webSocket.broadcastTXT("ESP NOW CB called!");

  // Push data into ctrl queue, ERLS task will process it
  // Note: accept only correctly formatted MSP packets
  Serial.write((uint8_t*)data, data_len);

  char hello[] = "ELRS_ACK\n";
  esp_now_send(mac_addr, (uint8_t*)hello, strlen(hello)); // send to all registered peers
}

void init_esp_now(void)
{
  WiFiMode_t mode = WiFi.getMode();
  if (mode == WIFI_OFF) {
    WiFi.mode(WIFI_STA); // Start wifi
  }

  espnow_init_info = "ESP NOW init...\n";

  if (esp_now_init() != 0) {
    espnow_init_info += "ESP NOW init failed!";
    return;
  }
  esp_now_set_self_role(ESP_NOW_ROLE_COMBO);
  esp_now_register_recv_cb(esp_now_recv_cb);

