kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
#ifdef ESP_NOW_PEERS
#define ESP_NOW_ETH_ALEN 6
  uint8_t peers[][ESP_NOW_ETH_ALEN] = ESP_NOW_PEERS;
  uint8_t num_peers = sizeof(peers) / ESP_NOW_ETH_ALEN;
  espnow_init_info += "add peers... ";
  for (uint8_t iter = 0; iter < num_peers; iter++) {
    esp_now_del_peer(peers[iter]);
    if (esp_now_add_peer(peers[iter], ESP_NOW_ROLE_COMBO, 0, NULL, 0) != 0) {
      espnow_init_info += "FAIL:";
      espnow_init_info += iter;
      espnow_init_info += ", ";
    }
  }
#endif // ESP_NOW_PEERS

  espnow_init_info += "\n Init DONE!";

  // Notify clients
  char hello[] = "ELRS\n";
  esp_now_send(NULL, (uint8_t*)hello, strlen(hello)); // send to all registered peers
}
#endif // ESP_NOW
/*************************************************/

void setup()
{
  IPAddress my_ip;

#ifdef INVERTED_SERIAL
  Serial.begin(460800, SERIAL_8N1, SERIAL_FULL, 1, true); // inverted serial
#else
  Serial.begin(460800); // non-inverted serial
#endif

  SPIFFS.begin();

  wifi_station_set_hostname("elrs_tx");

#if defined(WIFI_SSID) && defined(WIFI_PSK)
  if (WiFi.status() != WL_CONNECTED) {
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PSK);
  }
  uint32_t i = 0;
#define TIMEOUT (WIFI_TIMEOUT * 10)
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(100);
    if (++i > TIMEOUT) {
      break;
    }
  }
  if (i < TIMEOUT) {
    my_ip = WiFi.localIP();
  } else
#elif WIFI_MANAGER
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(STASSID " R9M")) {
    // AP found, connected
    my_ip = WiFi.localIP();
  }
  else
#endif /* WIFI_MANAGER */
  {
    // No WiFi found, start access point
    WiFi.mode(WIFI_AP);
    WiFi.softAP(STASSID " R9M", STAPSK);
    my_ip = WiFi.softAPIP();
  }

#if ESP_NOW
  init_esp_now();
#endif

  if (mdns.begin("elrs_tx", my_ip))
  {
    mdns.addService("http", "tcp", 80);
    mdns.addService("ws", "tcp", 81);
  }
  my_ipaddress_info_str = "My IP address = ";
  my_ipaddress_info_str += my_ip.toString();

  //Serial.print("Connect to http://elrs_tx.local or http://");
  //Serial.println(my_ip);

  server.on("/", handleRoot);
  server.on("/return", sendReturn);
  server.on("/mac", handleMacAddress);

  server.on(
      "/upload", HTTP_POST,       // if the client posts to the upload page
      []() { server.send(200); }, // Send status 200 (OK) to tell the client we are ready to receive
      handleFileUpload            // Receive and save the file
  );

  server.onNotFound(handleRoot);
  httpUpdater.setup(&server);
  server.begin();

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
}

int serialEvent()
{
  char inChar;
  while (Serial.available())
  {
    inChar = (char)Serial.read();

    if (msp_handler.processReceivedByte(inChar)) {
      webSocket.broadcastTXT("MSP received");
      // msp fully received
      mspPacket_t &msp_in = msp_handler.getPacket();
      if (msp_in.type == MSP_PACKET_V1_ELRS) {
        uint8_t * payload = (uint8_t*)msp_in.payload;
        switch (msp_in.function) {
          case ELRS_INT_MSP_PARAMS: {
            webSocket.broadcastTXT("ELRS params resp");
            settings_rate = payload[0];
            settings_tlm = payload[1];
            settings_power = payload[2];
            settings_power_max = payload[3];
            settings_region = payload[4];

            handleSettingDomain(NULL);
            handleSettingRate(NULL);
            handleSettingPower(NULL);
            handleSettingTlm(NULL);
#if ESP_NOW
            // Send current settings to all clients
            esp_now_send(NULL, (uint8_t*)msp_in.payload, msp_in.payloadSize);
#endif
            break;
          }
        };
      }
      msp_handler.markPacketFree();
    } else if (!msp_handler.mspOngoing())
    {
      if (inChar == '\r') {
        continue;
      } else if (inChar == '\n') {
        return 0;
      }
      inputString += inChar;
    }
  }
  return -1;
}

void loop()
{
  if (0 <= serialEvent())
  {
    webSocket.broadcastTXT(inputString);
    inputString = "";
  }

  server.handleClient();
  webSocket.loop();
  mdns.update();
}
